Revit 2024 API
RibbonItem.SetContextualHelp Method
Sets the contextual help bound with this button.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetContextualHelp(
	ContextualHelp contextualHelp
)
Visual Basic
Public Sub SetContextualHelp ( _
	contextualHelp As ContextualHelp _
)
Visual C++
public:
void SetContextualHelp(
	ContextualHelp^ contextualHelp
)
Parameters
contextualHelp
Type: Autodesk.Revit.UI.ContextualHelp
The contextual help.
See Also
RibbonItem Class
Autodesk.Revit.UI Namespace